## MySQL 설정
- Database Name: RSQL
- Table Name: Score
- id, korean, english, math (다 숫자)

## Anaconda Navigator
- rJava, RMySQL 설치

In [4]:
library(RMySQL)

Loading required package: DBI

In [6]:
# DB Connection 
conn <- dbConnect(MySQL(),
        dbname = 'RSQL',
        user = 'root',
        password = 'qwer1234',
        host = '127.0.0.1'
)

In [7]:
# 테이블 목록
dbListTables(conn)

[1] "score"

In [8]:
# 테이블의 컬럼 목록
dbListFields(conn, 'score')

[1] "id"         "korean"     "english"    "mathmatics"

In [9]:
# Select 
dbGetQuery(conn, 'select count(*) from score')

  count(*)
1 0

In [16]:
dbGetQuery(conn, 'select * from score')

  id korean english mathmatics
1 1  100    100     100
2 2   90     90      90

In [17]:
# insert
dbSendQuery(conn, 'insert into score values (1,100, 100, 100)')

result = dbGetQuery(conn, 'select * from score')
result

ERROR: Error in .local(conn, statement, ...): could not run statement: Duplicate entry '1' for key 'PRIMARY'

In [14]:
# insert 
dbSendQuery(conn, 'insert into score values (2,90, 90, 90)')

result = dbGetQuery(conn, 'select * from score')
result

ERROR: Error in .local(conn, statement, ...): could not run statement: Duplicate entry '2' for key 'PRIMARY'

In [19]:
# update
dbSendQuery(conn, 'update score set korean=90, english=80, mathematics=70 where id = 1')
result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathematics
1 1  90     80      70
2 2  90     90      90

In [20]:
# delete
dbSendQuery(conn, 'delete from score where id = 1')
result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathematics
1 2  90     90      90

In [21]:
# delete 전체 지우기

dbSendQuery(conn, 'delete from score')

result = dbGetQuery(conn, 'select * from score')
result

     id korean english mathematics

### CSV파일 한꺼번에 옮기기 
- 아래 두문장을 mySQL에 써줘야 한다 (실행까지) <br>
SHOW VARIABLES LIKE 'local_infile';   
SET GLOBAL local_infile = 1;

In [23]:
# csv file을 읽어서 MySQL에 넣기
data <- read.csv('../Data/score.csv', header = F)
colnames(data) <- c('id', 'korean', 'english', 'mathematics')
data

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [24]:
#overwrite=T :  다 지우고 덮어씀!  append=T :  기존 데이터에 덧붙임
dbWriteTable(conn, 'score', data, overwrite=T, row.names = F)

[1] TRUE

In [25]:
result = dbGetQuery(conn, 'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [26]:
str(result)

'data.frame':	10 obs. of  4 variables:
 $ id         : num  1 2 3 4 5 6 7 8 9 10
 $ korean     : num  90 90 90 90 90 100 100 100 100 100
 $ english    : num  80 88 89 87 60 100 100 100 100 100
 $ mathematics: num  70 70 70 70 70 100 100 100 100 100

In [28]:
data2 <- read.csv('../Data/score2.csv', header = F)
colnames(data2) <- c('id', 'korean', 'english', 'mathematics')

data2

  id korean english mathematics
1 11 90     80      70
2 12 90     88      70

In [29]:
#overwrite=T :  다 지우고 덮어씀!  append=T :  기존 데이터에 덧붙임
dbWriteTable(conn, 'score', data2, append=T, row.names = F)

[1] TRUE

In [30]:
result = dbGetQuery(conn, 'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100
11 11  90     80      70
12 12  90     88      70

In [31]:
# 다 했다면 Disconnect

dbDisconnect(conn)

[1] TRUE

> 끗